number_menu = 'Выберите пункт меню: '
menu_input_error = 'Введите ЧИСЛО от 1 до 8'

no_contact_or_file = 'Телефонная книга пуста или не открыта'


load_successful = 'Телефонная книга успешно загружена'
save_successful = 'Телефонная книга успешно сохранена!'
new_contact_successful = 'Контакт успешно создан!'

new_name = 'Введите имя и фамилию контакта: '
new_phone = 'Введите телефон контакта: '
new_comment = 'Введите комментарий к контакту: '

is_changed = 'Были внесены изменения. Сохранить? '
bye_bye = 'До свидания! Всего хорошего!'
